app/Controllers/Map.php

        $builder = $this->db->table('spot');
        $builder->select('category.name, spot.id_spot, spot.latitude, spot.longitude');
        $builder->join('category', 'category.id_category = spot.id_category');
        $spots = $builder->get()->getResultArray();
---
SELECT `category`.`name`, `spot`.`id_spot`, `spot`.`latitude`, `spot`.`longitude`
FROM `spot`
JOIN `category` ON `category`.`id_category` = `spot`.`id_category`