app/Controllers/Map.php

    public function __construct()
    {
        // Load session info to viewData
        $sessionData["is_admin"] = session()->is_admin;
        $sessionData["logged_in"] = session()->logged_in;
        $this->viewData["sessionData"] = $sessionData;

        // Prepare database
        $this->db = \Config\Database::connect();

        // Load categories to viewData
        $db = \Config\Database::connect();
        $builder = $db->table('category');
        $builder->orderBy('name', 'ASC');
        $catQuery = $builder->get();
---
SELECT *
FROM `category`
ORDER BY `name` ASC

    public function index()
    {
        $catFiltered = [];
        if(isset($_POST['category_name'])){
            foreach($this->viewData["categories"] as $category){
                if(strpos($category['name'], $_POST['category_name']) !== false){
                    $catFiltered[] = $category['name'];
                }
            }
        }
        $this->viewData["catFiltered"] = $catFiltered;

        $builder = $this->db->table('spot');
        $builder->select('category.name, spot.id_spot, spot.latitude, spot.longitude');
        $builder->join('category', 'category.id_category = spot.id_category');
        $spots = $builder->get()->getResultArray();
---
SELECT `category`.`name`, `spot`.`id_spot`, `spot`.`latitude`, `spot`.`longitude`
FROM `spot`
JOIN `category` ON `category`.`id_category` = `spot`.`id_category`