app/Controllers/SpotController.php

    public function getSpotPopupAjax(){
        $id_spot = $_POST["id_spot"];

        //get image
        $builder = $this->db->table('spot_image');
        $builder->select('content,extension');
        $builder->where('id_spot', $id_spot);
        $image = $builder->get(1)->getRowArray();

        //get spot info
        $builder = $this->db->table('spot');
        $builder->select('id_spot,latitude,longitude,spot_name,description');
        $builder->where('id_spot', $id_spot);
        $spot = $builder->get(1)->getRowArray();

        //count spot likes
        $builder = $this->db->table('spot_like');
        $builder->select('id_spot_like');
        $builder->where('id_spot', $id_spot);
        $spotLikes = $builder->countAllResults();

        //count spot comments
        $builder = $this->db->table('comment');
        $builder->select('id_comment');
        $builder->where('id_spot', $id_spot);
        $spotComments = $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `comment`
WHERE `id_spot` = '16'