app/Controllers/SpotController.php

    public function __construct()
    {
        // Load session info to viewData
        $sessionData["is_admin"] = session()->is_admin;
        $sessionData["logged_in"] = session()->logged_in;
        $sessionData["username"] = session()->username;
        $sessionData["profile_pic_src"] = session()->profile_pic_src;
        $sessionData["welcome_message"] = session()->welcome_message;
        $this->viewData["sessionData"] = $sessionData;
        session()->set('welcome_message', false);

        // Prepare database
        $this->db = \Config\Database::connect();

        // Load categories to viewData
        $builder = $this->db->table('category');
        $catQuery = $builder->get();
---
SELECT *
FROM `category`

    public function getSpotPopupAjax(){
        $id_spot = $_POST["id_spot"];

        //get image
        $builder = $this->db->table('spot_image');
        $builder->select('content,extension');
        $builder->where('id_spot', $id_spot);
        $image = $builder->get(1)->getRowArray();

        //get spot info
        $builder = $this->db->table('spot');
        $builder->select('id_spot,latitude,longitude,spot_name,description');
        $builder->where('id_spot', $id_spot);
        $spot = $builder->get(1)->getRowArray();

        //count spot likes
        $builder = $this->db->table('spot_like');
        $builder->select('id_spot_like');
        $builder->where('id_spot', $id_spot);
        $spotLikes = $builder->countAllResults();


        //check if spot is liked
        if(session()->logged_in){
            $builder = $this->db->table('spot_like');
            $builder->select('id_spot_like');
            $builder->where('id_spot', $id_spot);
            $builder->where('id_user', session()->id_user);
            if($builder->countAllResults() == 0){
---
SELECT `content`, `extension`
FROM `spot_image`
WHERE `id_spot` = '9'
 LIMIT 1
SELECT `content`, `extension`
FROM `spot_image`
WHERE `id_spot` = '16'
 LIMIT 1
SELECT `id_spot`, `latitude`, `longitude`, `spot_name`, `description`
FROM `spot`
WHERE `id_spot` = '9'
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `spot_like`
WHERE `id_spot` = '9'
SELECT COUNT(*) AS `numrows`
FROM `spot_like`
WHERE `id_spot` = '9'
AND `id_user` = '23'