app/Controllers/UserController.php

SELECT *
FROM `user`
---
    public function __construct()
    {
        // Load session info to viewData
        $sessionData["is_admin"] = session()->is_admin;
        $sessionData["logged_in"] = session()->logged_in;
        $sessionData["username"] = session()->username;
        $sessionData["mail"] = session()->mail;//only here
        $sessionData["id_user"] = session()->id_user;//only here
        $sessionData["profile_pic_src"] = session()->profile_pic_src;
        $sessionData["welcome_message"] = session()->welcome_message;
        $this->viewData["sessionData"] = $sessionData;
        session()->set('welcome_message', false);

        $this->db = \Config\Database::connect();

        $builder = $this->db->table('user');
        $userQuery = $builder->get();
        $this->viewData["users"] = $userQuery->getResultArray();

SELECT *
FROM `user`
---
            //prepare query
            $db = \Config\Database::connect();
            $builder = $db->table('user');
            $builder->get();

SELECT `description`
FROM `user`
WHERE `id_user` = '8'
 LIMIT 1
---
    public function displayProfile($username){
        $builder = $this->db->table('user');
        $builder->select('username,description,profile_pic,profile_pic_extension,id_user');
        $builder->where('username', $username);
        $user = $builder->get(1)->getRowArray();