app/Controllers/UserController.php

SELECT *
FROM `user`
---
            //prepare query
            $db = \Config\Database::connect();
            $builder = $db->table('user');
            $builder->get();